// DOM ( Document Object Model ) 이란 html 이라고하는 문자열 데이터를 
// 브라우저가 처리하기 위해서b 자체적으로 갖고 있게 되는 자료구조라고 
// 할 수 있습니다.
// ex)
document.getElementById('root');

// 하지만 현대적인 애플리케이션에서는 DOM 을 가지고 html 을 조작하는 방식은
// 지양하고 있습니다. ( ex: React, Vue 등...)
// 그 이유는 애플리케이션의 규모가 커질수록 유지관리가 거의 힘들 만큼
// 어렵게 만들어지는 구조를 가지고 있기 때문입니다.

// 그럼에도 프론트엔드 개발자로 잘 성장하려면 DOM 에 대해서 충분히
// 학습할 필요가 있습니다.( DOM 에 대한 이해가 필수적으로 필요 )
// DOM 을 직접 핸들링 하지 않더라도 DOM 의 핵심 데이터 타입들과 
// DOM 의 콘섭트 즉, 트리( 나무 구조 )구조와 관련된 콘셉트는 충분히
// 학습해서 남에게 설명할 수 있을 정도로는 이해를 해주셔야 합니다.
